surnames = ['Степанов',
            'Николаев',
            'Орлов',
            'Андреев',
            'Макаров',
            'Никитин',
            'Захаров',
            'Зайцев',
            'Соловьев',
            'Борисов',
            'Яковлева',
            'Григорьева',
            'Романова',
            'Воробьева',
            'Сергеева',
            'Кузьмина',
            'Фролова',
            'Александрова',
            'Дмитриева',
            'Королева',]

s = '1234123412341234'
print('\t'.join([s[i * 4: i * 4 + 4] for i in range(len(s) // 4)]))
print(len(s) // 4)